Ran Plan for dir: `infra/gcp/terraform/k8s-infra-prow-build` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # google_vmwareengine_network_peering.gvce_peering will be destroyed
  # (because google_vmwareengine_network_peering.gvce_peering is not in configuration)
- resource "google_vmwareengine_network_peering" "gvce_peering" {
      - create_time                         = "2025-05-13T16:47:02.453843949Z" -> null
      - export_custom_routes                = true -> null
      - export_custom_routes_with_public_ip = false -> null
      - id                                  = "projects/k8s-infra-prow-build/locations/global/networkPeerings/peer-with-gcve-project" -> null
      - import_custom_routes                = true -> null
      - import_custom_routes_with_public_ip = false -> null
      - name                                = "peer-with-gcve-project" -> null
      - peer_network                        = "projects/k8s-infra-prow-build/global/networks/default" -> null
      - peer_network_type                   = "STANDARD" -> null
      - project                             = "k8s-infra-prow-build" -> null
      - state                               = "ACTIVE" -> null
      - state_details                       = "[2025-05-13T09:47:06.560-07:00]: Connected." -> null
      - uid                                 = "f36f9473-6bc3-4dd1-8a01-a880b901a1bd" -> null
      - update_time                         = "2025-05-13T17:04:09.066424422Z" -> null
      - vmware_engine_network               = "projects/broadcom-451918/locations/global/vmwareEngineNetworks/k8s-gcp-gcve-network" -> null
        # (2 unchanged attributes hidden)
    }

  # module.sig_testing_node_pool_1_c4_highmem_8.google_container_node_pool.nodepool will be created
+ resource "google_container_node_pool" "nodepool" {
      + cluster                     = (sensitive value)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + instance_group_urls         = (known after apply)
      + location                    = (sensitive value)
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "sig-testing-pool1"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = [
          + "us-central1-b",
          + "us-central1-c",
          + "us-central1-f",
        ]
      + operation                   = (known after apply)
      + project                     = "k8s-infra-prow-build"
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 30
          + min_node_count  = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + network_config (known after apply)

      + node_config {
          + disk_size_gb     = 500
          + disk_type        = "hyperdisk-balanced"
          + effective_taints = (known after apply)
          + image_type       = "COS_CONTAINERD"
          + labels           = (known after apply)
          + local_ssd_count  = (known after apply)
          + logging_variant  = (known after apply)
          + machine_type     = "c4-highmem-8"
          + metadata         = (known after apply)
          + min_cpu_platform = (known after apply)
          + oauth_scopes     = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible      = false
          + service_account  = "gke-nodes-prow-build@k8s-infra-prow-build.iam.gserviceaccount.com"
          + spot             = false

          + confidential_nodes (known after apply)

          + gcfs_config (known after apply)

          + guest_accelerator (known after apply)

          + gvnic {
              + enabled = true
            }

          + kubelet_config (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = true
            }

          + taint {
              + effect = "NO_SCHEDULE"
              + key    = "dedicated"
              + value  = "sig-testing"
            }

          + windows_node_config (known after apply)

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + upgrade_settings (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d infra/gcp/terraform/k8s-infra-prow-build
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.k8s.io/lock?id=kubernetes%252Fk8s.io%252Finfra%252Fgcp%252Fterraform%252Fk8s-infra-prow-build%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d infra/gcp/terraform/k8s-infra-prow-build
  ```
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```